org/comsys/klausurthemen.org
#+TITLE: Klausurthemen
#+STARTUP: content
#+STARTUP: latexpreview
#+STARTUP: inlineimages
#+OPTIONS: toc:nil
#+BEGIN_HTML
---
layout: page
title: Klausurthemen
---
#+END_HTML

* Klausurthemen ComSys

(ca. 2. Termin 2011 - 1. Termin 2014)

- Netzwerke [1/2]
  - [X] /paket-/ und /circuit-switched/ Netzwerke (inkl. Vor- und Nachteile der verschiedenen Netzwerke)
  - [ ] Topologien (BUS, Star, Mesh, Ring; internet core Netzwerk ist mesh)
	- [ ] Einschätzung der Topologien bzgl. QoS Paramtern (throughput,
      delay, jitter, reliabiliy, availability)
- ISO/OSI-Referenzmodell [4/4]
  - [X] Bereiche (Schicht 1-4 transportorientiert; Schicht 5-7 anwendungsorientiert)
  - [X] Schichten (Namen, Funktion/Dienst und Beispielprotokolle)
  - [X] Gründe für Einteilung in Schichten (vs. monolithischer Ansatz)
  - [X] Nachteile der Einteilung in Schichten (z.B. Overhaed durch Header)
- Internetarchitektur [2/2]
  - [X] Transit- und Endsysteme (Welche Schichten des ISO/OSI-RM müssen in
    einem Transitsystem abgedeckt sein?)
  - [X] Prinzipien der Internetarchitektur (...)
- Quality of Service [2/2]
  - [X] Parameter:
    + datarate: Anzahl der bits, die pro Zeiteinheit über das Medium
      gesendet werden können in bit/s.
	+ throughput: Anzahl der erfolgreich übertragen bits (Daten +
      Overhead) pro Zeiteinheit in bit/s.
	+ delay: Dauer vom Senden des ersten bis zum Emfpang des letzen
      bits einer Nachricht
	+ jitter: mittlere Abweichung des Delay
	+ reliability: Zuverlässigkeit der Übertragung in Prozent (Anteil
      der Einheiten, die fehlerfrei übertragen wird an der Gesamtzahl
      der übertragenen Einheiten)
	+ availability: uptime eines Systems in Prozent
  - [X] Jitter-Buffer in VOIP-Anwendung (auch Größe berechnen)
- IPv4 [10/11]
  - [X] Welchen Dienst erbringt IPv4
  - [X] Arten der Nachrichtenübertragung (broadcast, unicast, multicast,
    anycast)
  - [X] Aufbau einer IPv4 Adresse
	- Adressgröße, etc.)
  - [ ] Aufbau eines IPv4 Header
	- version
	- header length
	- ...
  - [X] Hierarchische Adressierung in IPv4 (Networkprefix, host)
  - [X] private und öffentliche Adressen (warum werden sie unterschieden)
  - [X] classful und classless adressing (Vor- und Nachteile)
	- classful adressing
	- classless addressing (CIDR)
  - [X] (Port-)NAT (auch NAT-Tabelle erstellen können)
  - [X] Unterschiede zwischen IPv4 und IPv6 Header
  - [X] IPv6-in-IPv4-Tunnel
  - [X] Prinzip von /Traceroute/ mit ICMP
- IPv6 [5/6]
  - [X] Grund für die Umstellung auf IPv6
	- die Anzahl der freien IP Adressen im Adressraum von IPv4 wird
      immer knapper. Die IANA hat bereits 2011 die letzten freien
      Adressen mit 8-bit Netzwerkpräfix an die Regionla Registrars
      vergeben.
  - [X] Was hat sich bei Adressierung und Protokoll zwischen IPv4 und IPv6 verändert?
	- Adressen sind länger (128 statt 32 bit)
	- ein Interface kann mehr als eine Adresse haben (genau 1 link
      local Adresse, eine solicited node multicast address für host
      autoconfiguration, mehrere Adressen vom typ unicast, anycast und
      multicast)
	- feste header Länge; Auslagerung der optionalen Felder von IPv4
      (und anderer nicht-optionaler Felder) in extension headern
  - [X] Aufbau einer IPv6-Adresse
	- Länge: 128 bit
	- unicast, anycast: 64 bit Präfix, 64 bit Interface ID
	- multicast: 16 bit Präfix, 112 bit Group ID
  - [X] Bestandteile eines IPv6 Headers
	- version
	- traffic class
	- flow label
	- payload length
	- next header
	- hop limit
	- source address
	- destination address
  - [X] adress scopes
	- link local
	- unique local
	- global
  - [ ] host autoconfiguration (auf Basis der MAC-Adresse)
- [ ] DNS
  - [ ] Was leistet DNS
- [ ] SMTP
  - [ ] Beschreibung des Ablaufs beim Versenden einer Email per SMTP
- Transport(-schicht) [0/13]
  - [ ] TCP und UDP (Vorteile von UDP gegenüber TCP und umgekehrt,
    Unterschiede, 2 Einsatzbereiche nennen können) 
  - [ ] Abgrenzung von Verbindungsorientierten und verbindungslosen Protokollen
  - [ ] Zuordnung von Protokollen zur Familie der verbindungsorientierten oder verbindungslosen Protokolle
	- [ ] verbindungsorientiert: HTTP1.1, TCP
	- [ ] verbindungslos: HTTP1.0, UDP
  - [ ] 3 Phasen des Kommunikationsverlaufs bei verbindungsorientierte
    Kommunikation (Verbingungsaufbau, Datenübertragung, Schließen der
    Verbindung)
  - [ ] Zuordnung von Protokollen zur Famile der zuverlässigen oder unzuverlässigen (Transport-)Protokolle
	- [ ] zuverlässig: TCP
	- [ ] unzuverlässig: IP, UDP
  - [ ] TCP-(Three-Way-)Handshake
	- [ ] Welche Parameter werden beim Aufbau einer TCP-Verbindung ausgetauscht (sliding window größe?, ...)
  - [ ] Sliding Window Verfahren (Begrenzung der Window Größe)
  - [ ] Congestion Control (Slow Start, Congestion Avoidance)
  - [ ] Routing und Forwarding
	- [ ] Aktionen eines Routers beim Forwarding eines Pakets nennen und beschreiben
  - [ ] Hierarchische Routing über Autonome Systeme (/stub AS/, /multihomed AS/, /transit AS/)
  - [ ] /link-state-routing/ und /distance-vector-routing/
  - [ ] Routing-Tabellen erstellen
  - [ ] OSPF Protokoll (Funktionsweise erkären)
- Ethernet (LAN und WLAN) [1/3]
  - [ ] deterministische und probabilistische MAC-Verfahren zur Vermeidung von Kollisionen bei Nutzung eines gemeinsamen Mediums
	- [ ] probabilistisch: Collision Detection mit /CSMA/CD/ und /CSMA/CA/ (Funktionsweise erläutern können)
	- [ ] deterministisch: Token Ring
  - [X] Detektieren von Übertragungsfehlern mit /Cyclic Redundancy Check/ (inkl. Anwendung von CRC)
  - [ ] WLAN
	- [ ] hidden terminal problem
- [ ] MAC-Verfahren
- [ ] Email
  - [ ] Multipurpose Internet Mail Extension (MIME)
	- [ ] 2 MIME Parameter nennen
	- [ ] content types
  - [ ] Unterschied zwischen POP3 und IMAP

* TODO Fragen

- Funktion des Sessionlayer erklären (am liebsten am Beispiel eines TCP Socket)
- Unterschied zwischen Service access point, address und connection endpoint identifier
- bei Rechenaufgaben: $1 kbyte = 2^{10} byte$ oder $1 kbyte = 1000 byte$
- Unterschied zwischen routing table und forwarding table
- overlay principle erklären
- Serie 06 Aufgabe 3: Was ist der ARP Server? So was gibt es galube ich nicht
