comsys/klausurthemen.html
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Klausurthemen ComSys</a></li>
<li><a href="#sec-2">2. <span class="todo TODO">TODO</span> Fragen</a></li>
</ul>
</div>
</div>
---
layout: page
title: Klausurthemen
---

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Klausurthemen ComSys</h2>
<div class="outline-text-2" id="text-1">
<p>
(ca. 2. Termin 2011 - 1. Termin 2014)
</p>

<ul class="org-ul">
<li>Netzwerke <code>[1/2]</code>
<ul class="org-ul">
<li><code>[X]</code> <i>paket-</i> und <i>circuit-switched</i> Netzwerke (inkl. Vor- und Nachteile der verschiedenen Netzwerke)
</li>
<li><code>[&#xa0;]</code> Topologien (BUS, Star, Mesh, Ring; internet core Netzwerk ist mesh)
<ul class="org-ul">
<li><code>[&#xa0;]</code> Einschätzung der Topologien bzgl. QoS Paramtern (throughput,
delay, jitter, reliabiliy, availability)
</li>
</ul>
</li>
</ul>
</li>
<li>ISO/OSI-Referenzmodell <code>[4/4]</code>
<ul class="org-ul">
<li><code>[X]</code> Bereiche (Schicht 1-4 transportorientiert; Schicht 5-7 anwendungsorientiert)
</li>
<li><code>[X]</code> Schichten (Namen, Funktion/Dienst und Beispielprotokolle)
</li>
<li><code>[X]</code> Gründe für Einteilung in Schichten (vs. monolithischer Ansatz)
</li>
<li><code>[X]</code> Nachteile der Einteilung in Schichten (z.B. Overhaed durch Header)
</li>
</ul>
</li>
<li>Internetarchitektur <code>[2/2]</code>
<ul class="org-ul">
<li><code>[X]</code> Transit- und Endsysteme (Welche Schichten des ISO/OSI-RM müssen in
einem Transitsystem abgedeckt sein?)
</li>
<li><code>[X]</code> Prinzipien der Internetarchitektur (&#x2026;)
</li>
</ul>
</li>
<li>Quality of Service <code>[2/2]</code>
<ul class="org-ul">
<li><code>[X]</code> Parameter:
<ul class="org-ul">
<li>datarate: Anzahl der bits, die pro Zeiteinheit über das Medium
gesendet werden können in bit/s.
</li>
<li>throughput: Anzahl der erfolgreich übertragen bits (Daten +
Overhead) pro Zeiteinheit in bit/s.
</li>
<li>delay: Dauer vom Senden des ersten bis zum Emfpang des letzen
bits einer Nachricht
</li>
<li>jitter: mittlere Abweichung des Delay
</li>
<li>reliability: Zuverlässigkeit der Übertragung in Prozent (Anteil
der Einheiten, die fehlerfrei übertragen wird an der Gesamtzahl
der übertragenen Einheiten)
</li>
<li>availability: uptime eines Systems in Prozent
</li>
</ul>
</li>
<li><code>[X]</code> Jitter-Buffer in VOIP-Anwendung (auch Größe berechnen)
</li>
</ul>
</li>
<li>IPv4 <code>[10/11]</code>
<ul class="org-ul">
<li><code>[X]</code> Welchen Dienst erbringt IPv4
</li>
<li><code>[X]</code> Arten der Nachrichtenübertragung (broadcast, unicast, multicast,
anycast)
</li>
<li><code>[X]</code> Aufbau einer IPv4 Adresse
<ul class="org-ul">
<li>Adressgröße, etc.)
</li>
</ul>
</li>
<li><code>[&#xa0;]</code> Aufbau eines IPv4 Header
<ul class="org-ul">
<li>version
</li>
<li>header length
</li>
<li>&#x2026;
</li>
</ul>
</li>
<li><code>[X]</code> Hierarchische Adressierung in IPv4 (Networkprefix, host)
</li>
<li><code>[X]</code> private und öffentliche Adressen (warum werden sie unterschieden)
</li>
<li><code>[X]</code> classful und classless adressing (Vor- und Nachteile)
<ul class="org-ul">
<li>classful adressing
</li>
<li>classless addressing (CIDR)
</li>
</ul>
</li>
<li><code>[X]</code> (Port-)NAT (auch NAT-Tabelle erstellen können)
</li>
<li><code>[X]</code> Unterschiede zwischen IPv4 und IPv6 Header
</li>
<li><code>[X]</code> IPv6-in-IPv4-Tunnel
</li>
<li><code>[X]</code> Prinzip von <i>Traceroute</i> mit ICMP
</li>
</ul>
</li>
<li>IPv6 <code>[5/6]</code>
<ul class="org-ul">
<li><code>[X]</code> Grund für die Umstellung auf IPv6
<ul class="org-ul">
<li>die Anzahl der freien IP Adressen im Adressraum von IPv4 wird
immer knapper. Die IANA hat bereits 2011 die letzten freien
Adressen mit 8-bit Netzwerkpräfix an die Regionla Registrars
vergeben.
</li>
</ul>
</li>
<li><code>[X]</code> Was hat sich bei Adressierung und Protokoll zwischen IPv4 und IPv6 verändert?
<ul class="org-ul">
<li>Adressen sind länger (128 statt 32 bit)
</li>
<li>ein Interface kann mehr als eine Adresse haben (genau 1 link
local Adresse, eine solicited node multicast address für host
autoconfiguration, mehrere Adressen vom typ unicast, anycast und
multicast)
</li>
<li>feste header Länge; Auslagerung der optionalen Felder von IPv4
(und anderer nicht-optionaler Felder) in extension headern
</li>
</ul>
</li>
<li><code>[X]</code> Aufbau einer IPv6-Adresse
<ul class="org-ul">
<li>Länge: 128 bit
</li>
<li>unicast, anycast: 64 bit Präfix, 64 bit Interface ID
</li>
<li>multicast: 16 bit Präfix, 112 bit Group ID
</li>
</ul>
</li>
<li><code>[X]</code> Bestandteile eines IPv6 Headers
<ul class="org-ul">
<li>version
</li>
<li>traffic class
</li>
<li>flow label
</li>
<li>payload length
</li>
<li>next header
</li>
<li>hop limit
</li>
<li>source address
</li>
<li>destination address
</li>
</ul>
</li>
<li><code>[X]</code> adress scopes
<ul class="org-ul">
<li>link local
</li>
<li>unique local
</li>
<li>global
</li>
</ul>
</li>
<li><code>[&#xa0;]</code> host autoconfiguration (auf Basis der MAC-Adresse)
</li>
</ul>
</li>
<li><code>[&#xa0;]</code> DNS
<ul class="org-ul">
<li><code>[&#xa0;]</code> Was leistet DNS
</li>
</ul>
</li>
<li><code>[&#xa0;]</code> SMTP
<ul class="org-ul">
<li><code>[&#xa0;]</code> Beschreibung des Ablaufs beim Versenden einer Email per SMTP
</li>
</ul>
</li>
<li>Transport(-schicht) <code>[0/13]</code>
<ul class="org-ul">
<li><code>[&#xa0;]</code> TCP und UDP (Vorteile von UDP gegenüber TCP und umgekehrt,
Unterschiede, 2 Einsatzbereiche nennen können) 
</li>
<li><code>[&#xa0;]</code> Abgrenzung von Verbindungsorientierten und verbindungslosen Protokollen
</li>
<li><code>[&#xa0;]</code> Zuordnung von Protokollen zur Familie der verbindungsorientierten oder verbindungslosen Protokolle
<ul class="org-ul">
<li><code>[&#xa0;]</code> verbindungsorientiert: HTTP1.1, TCP
</li>
<li><code>[&#xa0;]</code> verbindungslos: HTTP1.0, UDP
</li>
</ul>
</li>
<li><code>[&#xa0;]</code> 3 Phasen des Kommunikationsverlaufs bei verbindungsorientierte
Kommunikation (Verbingungsaufbau, Datenübertragung, Schließen der
Verbindung)
</li>
<li><code>[&#xa0;]</code> Zuordnung von Protokollen zur Famile der zuverlässigen oder unzuverlässigen (Transport-)Protokolle
<ul class="org-ul">
<li><code>[&#xa0;]</code> zuverlässig: TCP
</li>
<li><code>[&#xa0;]</code> unzuverlässig: IP, UDP
</li>
</ul>
</li>
<li><code>[&#xa0;]</code> TCP-(Three-Way-)Handshake
<ul class="org-ul">
<li><code>[&#xa0;]</code> Welche Parameter werden beim Aufbau einer TCP-Verbindung ausgetauscht (sliding window größe?, &#x2026;)
</li>
</ul>
</li>
<li><code>[&#xa0;]</code> Sliding Window Verfahren (Begrenzung der Window Größe)
</li>
<li><code>[&#xa0;]</code> Congestion Control (Slow Start, Congestion Avoidance)
</li>
<li><code>[&#xa0;]</code> Routing und Forwarding
<ul class="org-ul">
<li><code>[&#xa0;]</code> Aktionen eines Routers beim Forwarding eines Pakets nennen und beschreiben
</li>
</ul>
</li>
<li><code>[&#xa0;]</code> Hierarchische Routing über Autonome Systeme (<i>stub AS</i>, <i>multihomed AS</i>, <i>transit AS</i>)
</li>
<li><code>[&#xa0;]</code> <i>link-state-routing</i> und <i>distance-vector-routing</i>
</li>
<li><code>[&#xa0;]</code> Routing-Tabellen erstellen
</li>
<li><code>[&#xa0;]</code> OSPF Protokoll (Funktionsweise erkären)
</li>
</ul>
</li>
<li>Ethernet (LAN und WLAN) <code>[1/3]</code>
<ul class="org-ul">
<li><code>[&#xa0;]</code> deterministische und probabilistische MAC-Verfahren zur Vermeidung von Kollisionen bei Nutzung eines gemeinsamen Mediums
<ul class="org-ul">
<li><code>[&#xa0;]</code> probabilistisch: Collision Detection mit <i>CSMA/CD</i> und <i>CSMA/CA</i> (Funktionsweise erläutern können)
</li>
<li><code>[&#xa0;]</code> deterministisch: Token Ring
</li>
</ul>
</li>
<li><code>[X]</code> Detektieren von Übertragungsfehlern mit <i>Cyclic Redundancy Check</i> (inkl. Anwendung von CRC)
</li>
<li><code>[&#xa0;]</code> WLAN
<ul class="org-ul">
<li><code>[&#xa0;]</code> hidden terminal problem
</li>
</ul>
</li>
</ul>
</li>
<li><code>[&#xa0;]</code> MAC-Verfahren
</li>
<li><code>[&#xa0;]</code> Email
<ul class="org-ul">
<li><code>[&#xa0;]</code> Multipurpose Internet Mail Extension (MIME)
<ul class="org-ul">
<li><code>[&#xa0;]</code> 2 MIME Parameter nennen
</li>
<li><code>[&#xa0;]</code> content types
</li>
</ul>
</li>
<li><code>[&#xa0;]</code> Unterschied zwischen POP3 und IMAP
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> <span class="todo TODO">TODO</span> Fragen</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Funktion des Sessionlayer erklären (am liebsten am Beispiel eines TCP Socket)
</li>
<li>Unterschied zwischen Service access point, address und connection endpoint identifier
</li>
<li>bei Rechenaufgaben: \(1 kbyte = 2^{10} byte\) oder \(1 kbyte = 1000 byte\)
</li>
<li>Unterschied zwischen routing table und forwarding table
</li>
<li>overlay principle erklären
</li>
<li>Serie 06 Aufgabe 3: Was ist der ARP Server? So was gibt es galube ich nicht
</li>
</ul>
</div>
</div>
